bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (serializeJson(doc, file) == 0) {
    Serial.println("Failed to serialize services.json");
  }
  file.close();
  Serial.println("Services saved");
}

void loadServices() {
  if (!littleFsReady) {
    Serial.println("LittleFS not mounted; skipping loadServices");
    return;
  }

  File file = LittleFS.open("/services.json", "r");
  if (!file) {
    Serial.println("No services.json found, starting fresh");
    return;
  }

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, file);
  file.close();

  if (error) {
    Serial.println("Failed to parse services.json");
    return;
  }

  JsonArray array = doc["services"];
  serviceCount = 0;

  for (JsonObject obj : array) {
    if (serviceCount >= MAX_SERVICES) break;

    services[serviceCount].id = obj["id"].as<String>();
    services[serviceCount].name = obj["name"].as<String>();
    services[serviceCount].type = (ServiceType)obj["type"].as<int>();
    services[serviceCount].host = obj["host"].as<String>();
    services[serviceCount].port = obj["port"];
    services[serviceCount].path = obj["path"].as<String>();
    services[serviceCount].url = obj["url"] | "";
    // Backward compatibility: generate URL from host/port/path if URL is empty
    if (services[serviceCount].url.length() == 0 && 
        services[serviceCount].type == TYPE_HTTP_GET &&
        services[serviceCount].host.length() > 0) {
      // Use HTTPS if port is 443, otherwise use HTTP
      String protocol = (services[serviceCount].port == 443) ? "https://" : "http://";
      services[serviceCount].url = protocol + services[serviceCount].host + 
                                   ":" + String(services[serviceCount].port) + 
                                   services[serviceCount].path;
    }
    services[serviceCount].expectedResponse = obj["expectedResponse"].as<String>();
    services[serviceCount].checkInterval = obj["checkInterval"];
    services[serviceCount].passThreshold = obj["passThreshold"] | 1;
    services[serviceCount].failThreshold = obj["failThreshold"] | 1;
    services[serviceCount].rearmCount = obj["rearmCount"] | 0;
    // SNMP-specific fields
    services[serviceCount].snmpOid = obj["snmpOid"] | "";
    services[serviceCount].snmpCommunity = obj["snmpCommunity"] | "public";
    services[serviceCount].snmpCompareOp = (SnmpCompareOp)(obj["snmpCompareOp"].as<int>());
    services[serviceCount].snmpExpectedValue = obj["snmpExpectedValue"] | "";
    // Push-specific fields
    services[serviceCount].pushToken = obj["pushToken"] | "";
    services[serviceCount].lastPush = 0;
    services[serviceCount].consecutivePasses = 0;
    services[serviceCount].consecutiveFails = 0;
    services[serviceCount].failedChecksSinceAlert = 0;
    services[serviceCount].isUp = false;
    services[serviceCount].hasBeenUp = false;
    services[serviceCount].lastCheck = 0;
    services[serviceCount].lastUptime = 0;
    services[serviceCount].lastError = "";
    services[serviceCount].secondsSinceLastCheck = -1;
    // Enable/disable and pause fields
    services[serviceCount].enabled = obj["enabled"] | true;  // Default to enabled
    services[serviceCount].pauseUntil = obj["pauseUntil"] | 0;

    serviceCount++;
  }

  Serial.printf("Loaded %d services\n", serviceCount);
}

String getServiceTypeString(ServiceType type) {
  switch (type) {
    case TYPE_HTTP_GET: return "http_get";
    case TYPE_PING: return "ping";
    case TYPE_SNMP_GET: return "snmp_get";
    case TYPE_PORT: return "port";
    case TYPE_PUSH: return "push";
    default: return "unknown";
  }
}

// --- LCD and Touch Screen Functions (Conditional) ---
#ifdef HAS_LCD

// Record user activity for screen timeout
void recordActivity() {
  lastActivityTime = millis();
}

// Turn screen off (backlight off)
void turnScreenOff() {
  if (!displayReady) return;
  // Cannot turn off backlight (GPIO 38) because it resets touch.
  // Cannot use PWM (dimming) because it resets touch.
  // Solution: Keep backlight ON (HIGH) and draw black screen to simulate off.
  if (TFT_BL_PIN >= 0) {
    digitalWrite(TFT_BL_PIN, HIGH);
  }
  display.fillScreen(TFT_BLACK);
  currentView = VIEW_OFF;
  Serial.println("Screen 'turned off' (Black screen, BL On)");
}

// Turn screen on (restore backlight)
void turnScreenOn() {
  if (!displayReady) return;
  // Ensure backlight is ON (HIGH)
  if (TFT_BL_PIN >= 0) {
    digitalWrite(TFT_BL_PIN, HIGH);
  }
  currentView = VIEW_MAIN;
  recordActivity();
  displayNeedsUpdate = true;
  Serial.println("Screen turned on");
}

void initDisplay() {
  Serial.println("Initializing display...");
  
  // Reset the GT911 touch controller with proper I2C address selection.
  // The GT911 I2C address is determined by the state of the INT pin during the
  // rising edge of RST:
  //   - INT HIGH during RST rise -> address 0x14
  //   - INT LOW during RST rise -> address 0x5D
  // Hardware note: On ESP32-4848S040, GPIO 38 is shared between touch reset and backlight.
  // After reset, LovyanGFX reconfigures this pin for PWM backlight control.
  if (TOUCH_RST_PIN >= 0) {
    // Configure INT pin as output and set HIGH to select address 0x14
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, OUTPUT);
      digitalWrite(TOUCH_INT_PIN, HIGH);
      delay(5);  // Ensure INT state is stable before reset sequence
    }
    
    // Perform reset sequence - timing is critical for GT911 address selection
    pinMode(TOUCH_RST_PIN, OUTPUT);
    digitalWrite(TOUCH_RST_PIN, LOW);
    delay(20);  // GT911 requires minimum 10ms reset pulse, use 20ms for margin
    digitalWrite(TOUCH_RST_PIN, HIGH);
    delay(100);  // Wait for GT911 address latch and internal initialization
    
    // Release INT pin for normal interrupt operation
    if (TOUCH_INT_PIN >= 0) {
      pinMode(TOUCH_INT_PIN, INPUT);
    }
    
    // Additional delay to allow GT911 I2C to stabilize after INT released
    delay(50);
    
    Serial.println("GT911 touch controller reset complete");

    // Debug: Scan I2C bus to verify GT911 presence and address
    Serial.printf("Scanning I2C bus (SDA=%d, SCL=%d)...\n", TOUCH_SDA_PIN, TOUCH_SCL_PIN);
    
    // Initialize Wire with explicit pins
    if (!Wire.begin(TOUCH_SDA_PIN, TOUCH_SCL_PIN)) {
      Serial.println("Failed to initialize I2C bus!");
    } else {
      int devicesFound = 0;
      uint8_t foundAddr = 0;
      for (byte address = 1; address < 127; address++) {
        Wire.beginTransmission(address);
        byte error = Wire.endTransmission();
        if (error == 0) {
          Serial.printf("I2C device found at address 0x%02X\n", address);
          devicesFound++;
          if (address == 0x14 || address == 0x5D) {
            foundAddr = address;
          }
        }
      }
      if (devicesFound == 0) Serial.println("No I2C devices found");
      
