bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
      // Important: End Wire so LGFX can initialize its own I2C driver
      Wire.end(); 
      delay(50);  // Ensure bus is free
    }
  }
  
  displayReady = display.init();
  display.setRotation(0);  // Rotation 0 for ESP32-4848S040 square display
  display.setTextSize(2);
  display.setTextColor(TFT_WHITE, TFT_BLACK);

  if (TFT_BL_PIN >= 0) {
    // Manually enable backlight (GPIO 38 HIGH)
    // This also takes the Touch Controller out of Reset
    pinMode(TFT_BL_PIN, OUTPUT);
    digitalWrite(TFT_BL_PIN, HIGH);
    // Give GT911 time to boot after taking it out of reset
    delay(200);
  }

  // Verify touch controller is working by checking if touch object exists and
  // attempting a test read. The touch object existing just means it was configured,
  // not that it successfully initialized and can communicate with the hardware.
  touchReady = false;
  lgfx::ITouch* touchController = display.touch();
  if (touchController != nullptr) {
    // Get the touch configuration for debug logging
    auto touchCfg = touchController->config();
    Serial.printf("Touch controller configured: I2C addr=0x%02X, INT pin=%d\n", 
                  touchCfg.i2c_addr, touchCfg.pin_int);
    
    // Attempt multiple test touch reads to verify I2C communication is working.
    // The GT911 may need a few polls to fully wake up and respond reliably.
    lgfx::touch_point_t tp;
    
    for (int attempt = 0; attempt < 5; attempt++) {
      // getTouch returns the number of touch points detected (0 or more)
      // Even if no touch is active, a successful read returns 0 (not -1 or error)
      // The important thing is that the call doesn't crash and the internal
      // state machine progresses
      display.getTouch(&tp, 1);
      delay(20);
    }
    
    // After triggering the initialization through reads, we consider it ready
    // if the touch object is still valid. The GT911 driver in LovyanGFX will
    // try both I2C addresses and set _inited if successful.
    touchReady = true;
    Serial.println("Touch controller (GT911) initialized successfully");
  } else {
    Serial.println("Touch controller not configured or not detected");
  }

  if (displayReady) {
    // Initialize screen timeout from config (SCREEN_TIMEOUT in seconds, 0 = disabled)
    // Validate: must be 0 (disabled) or between 10-600 seconds
    if (SCREEN_TIMEOUT == 0) {
      screenTimeoutMs = 0;  // Disabled
      Serial.println("Screen timeout disabled via config");
    } else if (SCREEN_TIMEOUT >= 10 && SCREEN_TIMEOUT <= 600) {
      screenTimeoutMs = (unsigned long)SCREEN_TIMEOUT * 1000;
      Serial.printf("Screen timeout set from config: %d seconds\n", SCREEN_TIMEOUT);
    } else {
      // Invalid value, use default 60 seconds
      screenTimeoutMs = 60000;
      Serial.printf("Invalid SCREEN_TIMEOUT value (%d), using default 60 seconds\n", SCREEN_TIMEOUT);
    }
    
    display.startWrite();
    display.fillScreen(TFT_BLACK);
    display.endWrite();
    currentView = VIEW_MAIN;
    recordActivity();
    displayNeedsUpdate = true;
    Serial.println("Display initialized successfully");
  } else {
    Serial.println("Display initialization failed");
  }
}

// Draw the header with title and power button
void drawHeader() {
  int16_t width = display.width();
  
  // Header background
  display.fillRect(0, 0, width, HEADER_HEIGHT, TFT_NAVY);
  
  // Title
  display.setTextColor(TFT_CYAN, TFT_NAVY);
  display.setTextSize(2);
  display.setCursor(10, 15);
  display.print("ESP32 Monitor");
  
  // WiFi status
  if (WiFi.status() == WL_CONNECTED) {
    display.setTextColor(TFT_WHITE, TFT_NAVY);
    display.setCursor(10, 32);
    display.setTextSize(1);
    display.print(WiFi.localIP().toString());
  }
  
  // Power button (top right)
  int powerBtnX = width - POWER_BUTTON_SIZE - 5;
  int powerBtnY = 5;
  display.fillRoundRect(powerBtnX, powerBtnY, POWER_BUTTON_SIZE, POWER_BUTTON_SIZE, 8, TFT_DARKGREY);
  display.drawRoundRect(powerBtnX, powerBtnY, POWER_BUTTON_SIZE, POWER_BUTTON_SIZE, 8, TFT_WHITE);
  
  // Power icon (simple circle with line)
  int iconCenterX = powerBtnX + POWER_BUTTON_SIZE / 2;
  int iconCenterY = powerBtnY + POWER_BUTTON_SIZE / 2;
  display.drawCircle(iconCenterX, iconCenterY, 10, TFT_WHITE);
  display.fillRect(iconCenterX - 2, iconCenterY - 12, 4, 10, TFT_WHITE);
}

// Get status color for a service
uint16_t getServiceStatusColor(const Service& svc) {
  if (!svc.enabled) {
    return TFT_DARKGREY;
  }
  if (svc.pauseUntil > 0 && getPauseRemainingMs(svc.pauseUntil, millis()) > 0) {
    return TFT_ORANGE;
  }
  if (svc.lastCheck == 0) {
    return TFT_BLUE;  // Pending
  }
  return svc.isUp ? TFT_GREEN : TFT_RED;
}

// Render main view showing all services as buttons
void renderMainView() {
  if (!displayReady) return;

  display.startWrite();
  display.fillScreen(TFT_BLACK);
  
  int16_t width = display.width();
  int16_t height = display.height();

  // Draw header
  drawHeader();

  // Show message if no services configured
  if (serviceCount == 0) {
    display.setCursor(10, HEADER_HEIGHT + 20);
    display.setTextColor(TFT_WHITE, TFT_BLACK);
    display.setTextSize(2);
    display.println("No services configured.");
    display.setCursor(10, HEADER_HEIGHT + 50);
    display.println("Add services via web UI.");
    display.endWrite();
    return;
  }

  // Calculate button layout - 2 columns
  int cols = 2;
  int buttonWidth = (width - (cols + 1) * SERVICE_BUTTON_MARGIN) / cols;
  int startY = HEADER_HEIGHT + SERVICE_BUTTON_MARGIN;
  int availableHeight = height - startY - SERVICE_BUTTON_MARGIN;
  int maxRows = availableHeight / (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
  
  // Draw service buttons
  for (int i = 0; i < serviceCount && i < maxRows * cols; i++) {
    int row = i / cols;
    int col = i % cols;
    
    int btnX = SERVICE_BUTTON_MARGIN + col * (buttonWidth + SERVICE_BUTTON_MARGIN);
    int btnY = startY + row * (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
    
    Service& svc = services[i];
    uint16_t statusColor = getServiceStatusColor(svc);
    
