bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
// Handle touch input for main view
void handleMainViewTouch(int16_t x, int16_t y) {
  int16_t width = display.width();
  int16_t height = display.height();
  
  // Check power button (top right) - simple tap to turn off screen
  int powerBtnX = width - POWER_BUTTON_SIZE - 5;
  int powerBtnY = 5;
  if (x >= powerBtnX && x <= powerBtnX + POWER_BUTTON_SIZE &&
      y >= powerBtnY && y <= powerBtnY + POWER_BUTTON_SIZE) {
    turnScreenOff();
    return;
  }
  
  // Check service buttons
  if (serviceCount > 0 && y > HEADER_HEIGHT) {
    int cols = 2;
    int buttonWidth = (width - (cols + 1) * SERVICE_BUTTON_MARGIN) / cols;
    int startY = HEADER_HEIGHT + SERVICE_BUTTON_MARGIN;
    int availableHeight = height - startY - SERVICE_BUTTON_MARGIN;
    int maxRows = availableHeight / (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
    
    for (int i = 0; i < serviceCount && i < maxRows * cols; i++) {
      int row = i / cols;
      int col = i % cols;
      
      int btnX = SERVICE_BUTTON_MARGIN + col * (buttonWidth + SERVICE_BUTTON_MARGIN);
      int btnY = startY + row * (SERVICE_BUTTON_HEIGHT + SERVICE_BUTTON_MARGIN);
      
      if (x >= btnX && x <= btnX + buttonWidth &&
          y >= btnY && y <= btnY + SERVICE_BUTTON_HEIGHT) {
        // Service button tapped - show detail view
        currentServiceIndex = i;
        currentView = VIEW_DETAIL;
        displayNeedsUpdate = true;
        return;
      }
    }
  }
}

// Handle touch input for detail view
void handleDetailViewTouch(int16_t x, int16_t y) {
  // Check back button (top left)
  if (x >= 5 && x <= 65 && y >= 5 && y <= 5 + POWER_BUTTON_SIZE) {
    currentView = VIEW_MAIN;
    displayNeedsUpdate = true;
    return;
  }
}

// Handle touch input when screen is off (double-tap to wake)
void handleScreenOffTouch(int16_t x, int16_t y) {
  unsigned long now = millis();
  
  // Check for double-tap
  if (now - lastTapTime <= DOUBLE_TAP_WINDOW_MS) {
    // Double-tap detected - wake up screen
    turnScreenOn();
    lastTapTime = 0;  // Reset to prevent accidental triple-tap
  } else {
    lastTapTime = now;
  }
}

void handleDisplayLoop() {
  if (!displayReady) return;

  unsigned long now = millis();

  // Handle touch input
  if (touchReady && (now - lastTouchTime >= TOUCH_DEBOUNCE_MS)) {
    lgfx::touch_point_t tp;
    int touchCount = display.getTouch(&tp, 1);
    
    if (touchCount > 0) {
      int16_t x = tp.x;
      int16_t y = tp.y;
      lastTouchTime = now;
      
      if (currentView == VIEW_OFF) {
        // Screen is off - check for double-tap to wake
        handleScreenOffTouch(x, y);
      } else {
        // Screen is on - record activity and handle touch
        recordActivity();
        
        switch (currentView) {
          case VIEW_MAIN:
            handleMainViewTouch(x, y);
            break;
          case VIEW_DETAIL:
            handleDetailViewTouch(x, y);
            break;
          default:
            break;
        }
      }
    }
  }
  
  // Handle screen timeout (only when screen is on and timeout is enabled)
  if (currentView != VIEW_OFF && screenTimeoutMs > 0) {
    if (now - lastActivityTime >= screenTimeoutMs) {
      turnScreenOff();
    }
  }

  // Update display if needed
  if (displayNeedsUpdate && currentView != VIEW_OFF) {
    switch (currentView) {
      case VIEW_MAIN:
        renderMainView();
        break;
      case VIEW_DETAIL:
        renderDetailView();
        break;
      default:
        break;
    }
    displayNeedsUpdate = false;
  }
  
  // Periodically refresh display to update status changes
  // Auto-refresh applies to both main view (all services) and detail view (single service)
  static unsigned long lastAutoRefresh = 0;
  if ((currentView == VIEW_MAIN || currentView == VIEW_DETAIL) && 
      now - lastAutoRefresh >= DISPLAY_AUTO_REFRESH_MS) {
    displayNeedsUpdate = true;
    lastAutoRefresh = now;
  }
}

#endif // HAS_LCD

String getWebPage() {
  return R"rawliteral(
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32 Uptime Monitor</title>
    <style>
        * {
            margin: 0;
            padding: 0;
            box-sizing: border-box;
        }

        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, sans-serif;
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            min-height: 100vh;
            padding: 20px;
        }

        .container {
            max-width: 1200px;
            margin: 0 auto;
        }

        .header {
            text-align: center;
            color: white;
            margin-bottom: 30px;
        }

        .header h1 {
            font-size: 2.5em;
            margin-bottom: 10px;
            text-shadow: 2px 2px 4px rgba(0,0,0,0.2);
        }

        .header p {
            font-size: 1.1em;
            opacity: 0.9;
        }

        .card {
            background: white;
            border-radius: 12px;
            padding: 25px;
            margin-bottom: 20px;
            box-shadow: 0 4px 6px rgba(0,0,0,0.1);
        }

        .add-service-form {
            display: grid;
            gap: 15px;
        }

        .form-group {
            display: flex;
            flex-direction: column;
        }

        .form-row {
            display: grid;
            grid-template-columns: 1fr 1fr;
            gap: 15px;
        }

        label {
            font-weight: 600;
            margin-bottom: 5px;
            color: #333;
            font-size: 0.9em;
        }

        input, select {
            padding: 10px;
            border: 2px solid #e0e0e0;
            border-radius: 6px;
            font-size: 1em;
            transition: border-color 0.3s;
        }

        input:focus, select:focus {
            outline: none;
            border-color: #667eea;
        }

        .btn {
            padding: 12px 24px;
            border: none;
            border-radius: 6px;
            font-size: 1em;
            font-weight: 600;
            cursor: pointer;
            transition: all 0.3s;
        }

        .btn-primary {
            background: linear-gradient(135deg, #667eea 0%, #764ba2 100%);
            color: white;
        }

        .btn-primary:hover {
            transform: translateY(-2px);
            box-shadow: 0 4px 12px rgba(102, 126, 234, 0.4);
        }

